Repository: pypi-data/pypi-mirror-321
Catalog: packages/human-readable/human_readable-2.0.0-py3-none-any.whl/human_readable/locale/*/LC_MESSAGES/human_readable.po
Languages: pt_br

source: th
pt_br: º

source: st
pt_br: º

source: nd
pt_br: º

source: rd
pt_br: º

source: th
pt_br: º

source: th
pt_br: º

source: th
pt_br: º

source: th
pt_br: º

source: th
pt_br: º

source: th
pt_br: º

source: million
pt_br: milhão

source: billion
pt_br: bilhão

source: trillion
pt_br: trilhão

source: quadrillion
pt_br: quatrilhão

source: quintillion
pt_br: quintilhão

source: sextillion
pt_br: sextilhão

source: septillion
pt_br: septilhão

source: octillion
pt_br: octilhão

source: nonillion
pt_br: nonilhão

source: decillion
pt_br: decilhão

source: googol
pt_br: undecilhão

source: one
pt_br: um

source: two
pt_br: dois

source: three
pt_br: três

source: four
pt_br: quatro

source: five
pt_br: cinco

source: six
pt_br: seis

source: seven
pt_br: sete

source: eight
pt_br: oito

source: nine
pt_br: nove

source: morning
pt_br: manhã

source: afternoon
pt_br: tarde

source: evening
pt_br: noite

source: {amount} minute
pt_br: {amount} minuto

source: {minute_translation} to {hour_count} hour
pt_br: {minute_translation} para a {hour_count} hora

source: {hour_count} o'clock
pt_br: {hour_count} hora

source: {minute_translation} past {hour_count}
pt_br: {hour_count} hora e {minute_translation}

source: midnight
pt_br: meia-noite

source: noon
pt_br: meio-dia

source: a quarter
pt_br: quinze

source: {reversed_minute_count} to midnight
pt_br: {reversed_minute_count} para a meia-noite

source: {reversed_minute_count} to noon
pt_br: {reversed_minute_count} para o meio-dia

source: {reversed_minute_count} to {hour_count}
pt_br: {reversed_minute_count} para a {hour_count}

source: half past {hour_count}
pt_br: {hour_count} e meia

source: a quarter past {hour_count}
pt_br: {hour_count} e quinze

source: {hour_count} and {minute_count}
pt_br: {hour_count} e {minute_count}

source: {clock} in the {period}
pt_br: {clock} da {period}

# hour 1
source: one
pt_br: uma

# hour 2
source: two
pt_br: duas

# hour 3
source: three
pt_br: três

# hour 4
source: four
pt_br: quatro

# hour 5
source: five
pt_br: cinco

# hour 6
source: six
pt_br: seis

# hour 7
source: seven
pt_br: sete

# hour 8
source: eight
pt_br: oito

# hour 9
source: nine
pt_br: nove

# hour 10
source: ten
pt_br: dez

# hour 11
source: eleven
pt_br: onze

# hour 12
source: twelve
pt_br: doze

# hour 13
source: one
pt_br: treze

# hour 14
source: two
pt_br: quatorze

# hour 15
source: three
pt_br: quinze

# hour 16
source: four
pt_br: dezesseis

# hour 17
source: five
pt_br: dezessete

# hour 18
source: six
pt_br: dezoito

# hour 19
source: seven
pt_br: dezenove

# hour 20
source: eight
pt_br: vinte

# hour 21
source: nine
pt_br: vinte e uma

# hour 22
source: ten
pt_br: vinte e duas

# hour 23
source: eleven
pt_br: vinte e três

# minute 1
source: one
pt_br: um

# minute 2
source: two
pt_br: dois

# minute 3
source: three
pt_br: três

# minute 4
source: four
pt_br: quatro

# minute 5
source: five
pt_br: cinco

# minute 6
source: six
pt_br: seis

# minute 7
source: seven
pt_br: sete

# minute 8
source: eight
pt_br: oito

# minute 9
source: nine
pt_br: nove

# minute 10
source: ten
pt_br: dez

# minute 11
source: eleven
pt_br: onze

# minute 12
source: twelve
pt_br: doze

# minute 13
source: thirteen
pt_br: treze

# minute 14
source: fourteen
pt_br: quatorze

# minute 15
source: fifteen
pt_br: quinze

# minute 16
source: sixteen
pt_br: dezesseis

# minute 17
source: seventeen
pt_br: dezessete

# minute 18
source: eighteen
pt_br: dezoito

# minute 19
source: nineteen
pt_br: dezenove

# minute 20
source: twenty
pt_br: vinte

# minute 21
source: twenty one
pt_br: vinte e um

# minute 22
source: twenty two
pt_br: vinte e dois

# minute 23
source: twenty three
pt_br: vinte e três

# minute 24
source: twenty four
pt_br: vinte e quatro

# minute 25
source: twenty five
pt_br: vinte e cinco

# minute 26
source: twenty six
pt_br: vinte e seis

# minute 27
source: twenty seven
pt_br: vinte e sete

# minute 28
source: twenty eight
pt_br: vinte e oito

# minute 29
source: twenty nine
pt_br: vinte e nove

# minute 30
source: thirty
pt_br: trinta

# minute 31
source: thirty one
pt_br: trinta e um

# minute 32
source: thirty two
pt_br: trinta e dois

# minute 33
source: thirty three
pt_br: trinta e três

# minute 34
source: thirty four
pt_br: trinta e quatro

# minute 35
source: thirty five
pt_br: trinta e cinco

# minute 36
source: thirty six
pt_br: trinta e seis

# minute 37
source: thirty seven
pt_br: trinta e sete

# minute 38
source: thirty eight
pt_br: trinta e oito

# minute 39
source: thirty nine
pt_br: trinta e nove

# minute 40
source: forty
pt_br: quarenta

# minute 41
source: forty one
pt_br: quarenta e um

# minute 42
source: forty two
pt_br: quarenta e dois

# minute 43
source: forty three
pt_br: quarenta e três

# minute 44
source: forty four
pt_br: quarenta e quatro

# minute 45
source: forty five
pt_br: quarenta e cinco

# minute 46
source: forty six
pt_br: quarenta e seis

# minute 47
source: forty seven
pt_br: quarenta e sete

# minute 48
source: forty eight
pt_br: quarenta e oito

# minute 49
source: forty nine
pt_br: quarenta e nove

# minute 50
source: fifty
pt_br: cinquenta

# minute 51
source: fifty one
pt_br: cinquenta e um

# minute 52
source: fifty two
pt_br: cinquenta e dois

# minute 53
source: fifty three
pt_br: cinquenta e três

# minute 54
source: fifty four
pt_br: cinquenta e quatro

# minute 55
source: fifty five
pt_br: cinquenta e cinco

# minute 56
source: fifty six
pt_br: cinquenta e seis

# minute 57
source: fifty seven
pt_br: cinquenta e sete

# minute 58
source: fifty eight
pt_br: cinquenta e oito

# minute 59
source: fifty nine
pt_br: cinquenta e nove

source: {amount} microsecond
pt_br: {amount} microssegundo

source: {amount} millisecond
pt_br: {amount} milissegundo

source: a moment
pt_br: um momento

source: a second
pt_br: um segundo

source: {amount} second
pt_br: {amount} segundo

source: a minute
pt_br: um minuto

source: an hour
pt_br: uma hora

source: {amount} hour
pt_br: {amount} hora

source: a day
pt_br: um dia

source: {amount} day
pt_br: {amount} dia

source: a month
pt_br: um mês

source: {amount} month
pt_br: {amount} mês

source: a year
pt_br: um ano

source: 1 year, {amount} day
pt_br: 1 ano e {amount} dia

source: 1 year, 1 month
pt_br: 1 ano e 1 mês

source: 1 year, {amount} month
pt_br: 1 ano e {amount} mês

source: {amount} year
pt_br: {amount} ano

source: now
pt_br: agora

source: {time_difference} from now
pt_br: em {time_difference}

source: {time_difference} ago
pt_br: há {time_difference}

source: today
pt_br: hoje

source: tomorrow
pt_br: amanhã

source: yesterday
pt_br: ontem

source: this year
pt_br: este ano

source: next year
pt_br: ano que vem

source: last year
pt_br: ano passado

source: {head} and {tail}
pt_br: {head} e {tail}
